{
  "personalInfo": {
    "name": "Juan Rosero",
    "title": "Senior Full Stack Developer",
    "location": "London, UK",
    "email": "juan@rosero.dev",
    "phone": "+44 7591 641684",
    "github": "https://github.com/skullerj",
    "website": "https://juan.rosero.dev"
  },
  "professionalSummary": "Born in the Andes mountains of Ecuador and now based in London, I'm a Full Stack Developer with 5+ years at Engine AI, where I've grown from Junior Developer to Squad Lead. Most recently, I've been leveraging React, Python and PostgreSQL to build platforms that allow clients to extract value from their data as the tech lead of one of our core AI solutions.",
  "technicalSkills": [
    {
      "label": "Frontend Development",
      "entries": ["React", "TypeScript", "HTML5", "CSS3", "GraphQL", "Astro"]
    },
    {
      "label": "Backend Development",
      "entries": [
        "Node.js",
        "NestJS",
        "Python",
        "FastAPI",
        "PostgreSQL",
        "Weaviate",
        "Elasticsearch"
      ]
    },
    {
      "label": "Tools and Technologies",
      "entries": [
        "Docker",
        "Azure",
        "AWS",
        "Firebase",
        "Jest",
        "Vite",
        "Storybook"
      ]
    }
  ],
  "experience": [
    {
      "company": "Engine AI",
      "location": "Lisbon & London",
      "position": "Senior Full Stack Developer & Squad Lead",
      "duration": "September 2020 - Present",
      "description": "Started as a Junior Developer and grew into a Squad Lead role over the past 5 years at this data insights startup. I've worked on building the core platform and on leveraging it to help clients turn their data into something useful. In my current role as Squad Lead, I'm in charge of making sure the team delivers high-quality features on time and while I miss hand-on coding, I get to help other people produce their best outcomes, which is something I value a lot.",
      "achievements": [
        [
          "Developed our Dashboard Engine and API",
          "My first job, was to extend what we call our \"Dashboard Engine\" - a React app that can transform configuration into full fledged dashboards with built-in design system customization. At the same time, developed the backend which would provide the configuration and data the dashboards would require."
        ],
                [
          "Rapid prototyping",
          "I was in charge of high stakes high rewards prototypes for potential clients. We wanted to \"show not tell\", and my skills making sure something looks good came very well in hand here."
        ],
        [
                  "Squad Lead on a core AI solution",
                  "Currently leading the development of our Research Intelligence solution, which helps clients navigate and extract insights from large collections of documents. This has been a great opportunity to learn about AI solutions and how to manage a development team effectively. I've learned Python in the process  which is a great perk"
                ]
      ],
      "technologies": [
        "TypeScript",
        "Python",
        "React",
        "PostgreSQL",
        "GraphQL",
        "Docker",
        "AWS",
        "Azure"
      ]
    },
    {
      "company": "Jobsity",
      "location": "Quito",
      "position": "Frontend Developer",
      "duration": "September 2018 - December 2019",
      "description": "Started as part of Jobsity's JSchool program, which I accessed through a hackathon and completed with merits. This lead to a full-time Front End Developer position. Jobsity connects Latin American developers with clients from the US and while working there I used my Full Stack skills mainly to develop internal tools ",
      "achievements": [
        [
          "Developed React component library",
          "Built the React component library that we used for internal and external platforms. I made sure they look good, are reusable and tested/showcased them using Storybook."
        ],
        [
          "Built customer-employee management platform",
          "While also creating the library, I worked on using it on the main platform that helped clients manage their remote teams effectively. This meant not only just bulding the UI but also the backend that would support it."
        ]
      ],
      "technologies": ["React", "Storybook", "NestJS", "TypeScript"]
    }

  ],
  "education": [
    {
      "institution": "Universidad de las Américas",
      "location": "Quito",
      "degree": "Electronics and Telecommunications Engineering",
      "duration": "July 2012 - February 2018",
      "details": [
        "Full merit scholarship awarded by the State",
        "Thesis: Bottle image classification system using Convolutional Neural Networks",
        "Equivalent to Masters in Computer Science (European standard)"
      ]
    }
  ],
  "continuousLearning": [
    {
      "course": "Design Thinking, the Ultimate Guide",
      "institution": "Interaction Design Foundation",
      "completionDate": "June 2023"
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "proficiency": "Native"
    },
    {
      "language": "English",
      "proficiency": "Advanced"
    },
    {
      "language": "Portuguese",
      "proficiency": "Mid-Advanced"
    }
  ],
  "keyStrengths": [
    {
      "title": "Design mindset",
      "description": "I don't believe in perfect the first time. Iteration and continuos impromements are the bread and butter of my work. I'm also alright when someone asks my opinion on visual design matters and product usability."
    },
    {
      "title": "Positive & Great communicator",
      "description": "I can put complex technical concepts into bit sized easy to understand pieces. Also, I'm empathetic and a postive person. I like what I do and I bring this energy to my team."
    },
    {
      "title": "Technical leadership",
      "description": "I'm a good leader. I can create a vision of where we need to go and encourage and support the team to get there together."
    }
  ]
}
